"""
Задача №2

Равлик повзе по вертикальній жердині висотою h метрів, піднімаючись за день на a метрів,
а за ніч спускаючись на b метрів.
На який день равлик доповзе до вершини жердини?
Дані вводяться у порядку h, a, b.

Виконала: Гриб Наталія Григорівна, 31І група
"""

h = int(input("Введіть висоту жердини:"))
a = int(input("Введіть к-сть метрів на яку за день підіймається равлик:"))
b = int(input("Веддіть к-сть метрів на яку за ніч спускається равлик:"))

days = h//(a-b)

print("Равлик допозве до вершини жердини за", days, "днів")
