"""
Задача №4

Напишіть програму, яка виводить перше слово у рядку.
Слово - це послідовність непробільних символів, обмежена пропусками або межами рядка.
Вхідний рядок містить довільну послідовність символів.
Програма повинна вивести перше слово цього рядка.

Виконала: Гриб Наталія Григорівна, 31І група
"""

n = input('Введіть рядок:')

text = n.split()

print(text[0])
